---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemFunction
source: html/f59c9338-8945-698a-6281-33f48782e74b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemFunction Property

"Function": Function

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemFunction { get; }
```